[
  {
    "text" : "okay let's go really quickly my markdown to blog capstone blog folio",
    "timestamp" : "00:00.660-00:07.180"
  },
  {
    "text" : "a long-term project of having a knowledge base of everything knowledge",
    "timestamp" : "00:10.360-00:13.900"
  },
  {
    "timestamp" : "00:14.200-00:17.220",
    "text" : "crafts I'm already done with all of these"
  },
  {
    "text" : "viral video bias lab CLI boom continue with the list by the way",
    "timestamp" : "00:19.540-00:24.720"
  },
  {
    "text" : "Omi didn't get to work on this. Splitwise, Steam, MCQ, I'm done talking about that.",
    "timestamp" : "00:25.500-00:34.620"
  },
  {
    "timestamp" : "00:39.340-00:42.240",
    "text" : "Okay, Omi hackathon was, yeah, Spotify wrapped."
  },
  {
    "timestamp" : "00:44.500-00:48.740",
    "text" : "I want to count on me, useful."
  },
  {
    "timestamp" : "01:02.800-01:07.000",
    "text" : "Percy Jacksonify, yes. This one is just a"
  },
  {
    "timestamp" : "01:09.500-01:16.180",
    "text" : "tour guide image to text with 11 labs output so image to story and"
  },
  {
    "text" : "Percy Jackson style writing 11 labs narration output whisper uh no",
    "timestamp" : "01:16.920-01:23.180"
  },
  {
    "timestamp" : "01:26.360-01:31.400",
    "text" : "yeah chatgpt's whisper is not trustworthy on android especially when it's longer"
  },
  {
    "timestamp" : "01:32.420-01:36.400",
    "text" : "and I don't want to record everything on google and then manually transcribe it myself so I made"
  },
  {
    "timestamp" : "01:36.400-01:42.759",
    "text" : "my own whisper an android app for whisper that's more dependable"
  },
  {
    "timestamp" : "01:46.120-01:52.100",
    "text" : "hyperbolic labs and done with that unnorminator yes the coinbase on-chain hackathon where"
  },
  {
    "text" : "i basically used google real-time live api something what was that live api",
    "timestamp" : "01:52.620-02:00.780"
  },
  {
    "text" : "multi-model live api yes back then it was called multi-model live api february 3",
    "timestamp" : "02:04.660-02:09.020"
  },
  {
    "timestamp" : "02:09.899-02:14.839",
    "text" : "it's an unnorminator because this was inspired by me being a normie at everything"
  },
  {
    "timestamp" : "02:15.820-02:21.440",
    "text" : "blockchain and crypto so this was something your grandma could use so that you could"
  },
  {
    "timestamp" : "02:23.300-02:29.340",
    "text" : "um navigate the crypto world and because it would talk it would look at your screen and talk back"
  },
  {
    "text" : "and actually even have access to the internet so you can do searches for you",
    "timestamp" : "02:29.640-02:32.280"
  },
  {
    "timestamp" : "02:33.200-02:38.599",
    "text" : "so it tells you where to click what to click and why and i've talked about the micromouse"
  },
  {
    "text" : "my software class i'm not sure how i don't think that's relevant anyway they'll take home",
    "timestamp" : "02:48.600-02:56.220"
  },
  {
    "text" : "i got the university uai in argentina the setting up arduino portenta h7 with gamma",
    "timestamp" : "02:57.030-03:03.880"
  },
  {
    "text" : "shield for uai on c plus plus of course the uber one i've talked about that",
    "timestamp" : "03:03.980-03:09.080"
  },
  {
    "text" : "more of the portenta remote led and of course mendieta project that was the",
    "timestamp" : "03:11.480-03:18.640"
  },
  {
    "text" : "actual name of the project the open source node.js block based robotics for elementary students",
    "timestamp" : "03:18.750-03:24.300"
  },
  {
    "text" : "build in public ai was the one that got me a 16z demo not demo day but demo product who was that guy",
    "timestamp" : "03:29.720-03:39.020"
  },
  {
    "timestamp" : "03:56.880-04:02.900",
    "text" : "i forgot it was the name of uh i have to actually look for him right now but it was built in public ai and"
  },
  {
    "timestamp" : "04:08.400-04:09.340",
    "text" : "the guy from chennai"
  },
  {
    "timestamp" : "04:12.940-04:17.640",
    "text" : "vinai yes layer path it was the guy from layer path"
  },
  {
    "timestamp" : "04:20.440-04:20.820",
    "text" : "so"
  },
  {
    "text" : "yeah another blog entry the real the realization of how",
    "timestamp" : "04:30.980-04:34.960"
  },
  {
    "timestamp" : "04:36.900-04:42.240",
    "text" : "your ideas should be protected because we didn't get to build in time because we were new and so"
  },
  {
    "text" : "we literally had this engineer do it and we didn't get any money for it nailed by a detection detector",
    "timestamp" : "04:42.270-04:47.980"
  },
  {
    "timestamp" : "04:48.760-04:51.080",
    "text" : "that's pretty good rpg task list that would be good"
  },
  {
    "timestamp" : "04:53.900-04:59.920",
    "text" : "ah this one's a more academic one maybe i should publish all of my assignments as well"
  },
  {
    "text" : "but it's a linear code image compression",
    "timestamp" : "05:00.520-05:02.760"
  },
  {
    "text" : "and so it uses orthogonal basis for lossy image compression",
    "timestamp" : "05:04.720-05:07.940"
  },
  {
    "text" : "and of course mineral community extensions",
    "timestamp" : "05:14.460-05:16.640"
  },
  {
    "text" : "oh yeah and i have also like a minerva student id chrome extension which just basically displays",
    "timestamp" : "05:33.160-05:39.460"
  },
  {
    "text" : "an id i think it's a very subtle but big cognitive load thing so i'm going to include",
    "timestamp" : "05:39.960-05:44.880"
  },
  {
    "timestamp" : "05:44.900-05:58.760",
    "text" : "this the Minerva student ID Chrome extension and of course uh an archive on Edgar which was my"
  },
  {
    "timestamp" : "05:59.290-06:05.800",
    "text" : "summer second year of summer internship it was let's just add this under experiences Edgar where"
  },
  {
    "text" : "i was the lead for ai yeah for ai and then what is this by api to react to comments",
    "timestamp" : "06:05.820-06:20.480"
  },
  {
    "text" : "let's not talk about that",
    "timestamp" : "06:24.820-06:26.640"
  },
  {
    "text" : "drf",
    "timestamp" : "06:29.759-06:30.520"
  },
  {
    "text" : "Anything noteworthy here?",
    "timestamp" : "06:46.780-06:48.180"
  },
  {
    "text" : "I guess we could put in my assignments for CS110 as well, which was my data structures and",
    "timestamp" : "06:50.820-06:56.919"
  },
  {
    "timestamp" : "06:58.440-07:03.680",
    "text" : "my data structure is an algorithm class and i guess another certification is the technical"
  },
  {
    "timestamp" : "07:03.960-07:13.520",
    "text" : "interview prep 103 which is the advanced one at code path i did that and then oh Hachiko"
  },
  {
    "text" : "of course Hachiko this was something i made in QHacks in Mannheim in Berlin",
    "timestamp" : "07:17.140-07:23.479"
  },
  {
    "timestamp" : "07:26.160-07:37.120",
    "text" : "so it's essentially um a web app version of the entrance so this is two pro two projects one one"
  },
  {
    "text" : "a hackathon and this one almost one a hackathon but the first one and i have a video for the pitch",
    "timestamp" : "07:37.120-07:42.320"
  },
  {
    "text" : "so that's pretty cool but q hacks hatchiko is just basically a chat bot that converts your boring",
    "timestamp" : "07:42.460-07:52.680"
  },
  {
    "timestamp" : "07:52.700-07:59.980",
    "text" : "abstract math questions into one that motivates you that channels your intrinsic motivation and"
  },
  {
    "text" : "this was born out of another project called is math even useful in real life which won something",
    "timestamp" : "08:00.100-08:05.820"
  },
  {
    "timestamp" : "08:06.140-08:12.180",
    "text" : "so add those two projects and then another take-home project for edgar software engineer internship"
  },
  {
    "text" : "which was a whisper text-to-speech thing and another another thing for minerva it was just a thermal it",
    "timestamp" : "08:12.460-08:19.720"
  },
  {
    "timestamp" : "08:22.060-08:28.380",
    "text" : "which was a Stremel IT dashboard for Minerva University's five kilometer run which used"
  },
  {
    "text" : "which taught me how to publish sheets as csvs and then of course another oh another experience is",
    "timestamp" : "08:28.830-08:37.280"
  },
  {
    "text" : "I was working as a board game digitizer should I just say software engineer for",
    "timestamp" : "08:38.740-08:45.320"
  },
  {
    "text" : "Brand new Bundestag in Berlin where I worked on their game Ade AFD and that's civic part two they",
    "timestamp" : "08:47.120-08:53.100"
  },
  {
    "text" : "were my civic partner in Berlin so and of course my scheduler that's another part of my assignment",
    "timestamp" : "08:53.100-09:00.660"
  },
  {
    "text" : "we'll go through that for my assignment the data gathering will be harsh anyway maybe we can even",
    "timestamp" : "09:00.790-09:06.620"
  },
  {
    "text" : "use a github api for this economy sure another project stock trading bot python yeah cool just",
    "timestamp" : "09:06.820-09:16.279"
  },
  {
    "timestamp" : "09:16.300-09:24.900",
    "text" : "an experiment image to heic of course this is a homemade solution for my dad so he could"
  },
  {
    "text" : "archive my mom's ipad photos which had a unique file format of heic",
    "timestamp" : "09:24.990-09:29.140"
  },
  {
    "text" : "and then of course another assignment mark of matrix of foot traffic and soul",
    "timestamp" : "09:32.280-09:36.280"
  },
  {
    "text" : "oh and draw a ui that's i wonder about that and then another one is an experience where i was",
    "timestamp" : "09:37.810-09:43.879"
  },
  {
    "text" : "software engineer intern for, for payroll, like Google GCP and yet another mail merge.",
    "timestamp" : "09:45.980-09:56.040"
  },
  {
    "text" : "Then of course my experience at my experience at, it's not here.",
    "timestamp" : "09:56.610-10:06.880"
  },
  {
    "text" : "My experience at Northeastern where I was a game developer for two games.",
    "timestamp" : "10:08.440-10:13.780"
  },
  {
    "text" : "More on that later.",
    "timestamp" : "10:14.610-10:15.360"
  },
  {
    "text" : "yes to be more specific my summer my finance internship was automated",
    "timestamp" : "10:19.760-10:24.540"
  },
  {
    "timestamp" : "10:28.019-10:31.080",
    "text" : "automated offer letter generator"
  },
  {
    "text" : "yeah",
    "timestamp" : "10:44.540-10:44.599"
  },
  {
    "timestamp" : "10:44.620-10:53.460",
    "text" : "I got the pure play code but I'm not sure if that's enough daily work tracker"
  },
  {
    "timestamp" : "11:08.220-11:08.800",
    "text" : "what else"
  },
  {
    "text" : "oh more assignments of course the gray area that was a project for massason foundation",
    "timestamp" : "11:11.340-11:18.260"
  },
  {
    "timestamp" : "11:19.940-11:25.220",
    "text" : "the gray area and i worked with a few other people so that's another project"
  },
  {
    "text" : "then of course my speaking engagement with google cebu",
    "timestamp" : "11:29.900-11:32.359"
  },
  {
    "timestamp" : "11:46.180-11:50.960",
    "text" : "of course my post-summer assessment with minerva showed my thinking pre-chat gpt"
  },
  {
    "timestamp" : "11:59.540-12:02.040",
    "text" : "pre-japtgbt but co-pilot was there"
  },
  {
    "timestamp" : "12:05.320-12:06.660",
    "text" : "and then that was the end actually"
  },
  {
    "timestamp" : "12:11.240-12:15.260",
    "text" : "yeah and 2022 was when i started to learn about react that's a long time ago"
  },
  {
    "text" : "so i want to see if i still have my old github repository",
    "timestamp" : "12:16.240-12:20.380"
  },
  {
    "text" : "Hierofahde,",
    "timestamp" : "12:23.000-12:23.600"
  },
  {
    "text" : "But I'm glad that I got to talk about all of my projects, so now I can just curate the best.",
    "timestamp" : "12:53.300-12:59.300"
  },
  {
    "text" : "Then I'm logging into my old GitHub now.",
    "timestamp" : "13:09.400-13:11.720"
  },
  {
    "timestamp" : "13:41.940-13:42.920",
    "text" : "over my workflow"
  },
  {
    "text" : "ok",
    "timestamp" : "13:44.220-13:45.000"
  },
  {
    "timestamp" : "13:47.600-13:48.200",
    "text" : "that's crazy"
  },
  {
    "timestamp" : "13:52.280-13:52.840",
    "text" : "it's actually"
  },
  {
    "text" : "where did I even commit them",
    "timestamp" : "14:00.000-14:02.100"
  },
  {
    "timestamp" : "14:14.660-14:19.480",
    "text" : "what when it's my very first github yes this was my first github"
  },
  {
    "text" : "it was with my cbk oh there it is so with my old account which is weirdly merged with my new account",
    "timestamp" : "14:22.280-14:32.559"
  },
  {
    "text" : "ah yes i could talk about my other projects",
    "timestamp" : "14:34.340-14:36.320"
  },
  {
    "timestamp" : "14:44.860-14:45.520",
    "text" : "could i just"
  },
  {
    "timestamp" : "14:56.040-14:59.080",
    "text" : "okay cool so i do get to access my old github account"
  },
  {
    "text" : "all of my old projects are here so let's go",
    "timestamp" : "15:21.580-15:25.660"
  },
  {
    "timestamp" : "15:28.600-15:36.280",
    "text" : "yeah so first i want to talk about the butterfly effect which was a health reminder bot for micro"
  },
  {
    "text" : "habits and discord which eventually evolved into a chrome extension and airpods replica is when i",
    "timestamp" : "15:36.480-15:42.660"
  },
  {
    "timestamp" : "15:42.880-15:49.080",
    "text" : "first learned of lott files when i was working on webflow this was february 2021 and lsm generator"
  },
  {
    "text" : "was a funny valentine gig where they generate a long sweet message for special someone although",
    "timestamp" : "15:49.100-15:53.599"
  },
  {
    "timestamp" : "15:53.620-16:01.340",
    "text" : "this wasn't using gpt or any transformers it was just pre-made messages that would showcase itself"
  },
  {
    "timestamp" : "16:01.620-16:09.920",
    "text" : "at a click of a button and of course i this is a big one of my bigger wins which was i won a"
  },
  {
    "text" : "competition by overwatch it was an art competition but they immediately removed took down their winner",
    "timestamp" : "16:10.020-16:16.920"
  },
  {
    "text" : "site so I used the Wayback Machine to duplicate and immortalize my site and the cell world",
    "timestamp" : "16:17.020-16:26.000"
  },
  {
    "text" : "was a 3D biology plant and animal cell viewer it was a project for my biology class in 11th grade",
    "timestamp" : "16:27.780-16:34.600"
  },
  {
    "text" : "and it's a pure sketchfab viewer API embed cleaned out from CodePen because I had to clean out",
    "timestamp" : "16:36.380-16:43.039"
  },
  {
    "text" : "irrelevant parts oh i also did gesture stickers which was an experiment of gestures slash",
    "timestamp" : "16:43.060-16:50.740"
  },
  {
    "text" : "annotations overlay with google's teachable machine and it was uh a code layer over obs",
    "timestamp" : "16:51.140-16:58.380"
  },
  {
    "text" : "obs virtual camera then andy bought what is that people",
    "timestamp" : "16:59.320-17:03.120"
  },
  {
    "text" : "Send one oh this was a python file with all of my channel id and bot tokens in public great i have to",
    "timestamp" : "17:06.439-17:16.319"
  },
  {
    "timestamp" : "17:17.050-17:20.060",
    "text" : "remove that anyway carl caught"
  },
  {
    "timestamp" : "17:23.260-17:30.480",
    "text" : "segue medirecords it was simplified um electronic file records with notion i actually had to get to"
  },
  {
    "timestamp" : "17:30.500-17:35.460",
    "text" : "talk to a HIPAA lawyer in California which is great foreshadowing that I'm"
  },
  {
    "text" : "gonna be ended up there but I eventually got this piloted in a local hospital and",
    "timestamp" : "17:35.460-17:42.400"
  },
  {
    "text" : "animated grain BG CSS only it's an empty commit but that was old me that was",
    "timestamp" : "17:42.900-17:54.220"
  },
  {
    "text" : "really cool if I had curate the project I would go with the butterfly effects the",
    "timestamp" : "17:54.360-17:59.400"
  },
  {
    "text" : "butterfly effect, cell world, segue meta records, and yeah,",
    "timestamp" : "17:59.420-18:06.020"
  },
  {
    "text" : "SSD C or similar, which was the Overwatch win.",
    "timestamp" : "18:07.860-18:10.340"
  },
  {
    "text" : "Now that I'm done with that.",
    "timestamp" : "18:11.240-18:12.260"
  },
  {
    "text" : "Oh, no.",
    "timestamp" : "18:13.300-18:13.580"
  }
]